Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_142 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_143 (Dense)            (None, 272)               184688    
_________________________________________________________________
dense_144 (Dense)            (None, 944)               257712    
_________________________________________________________________
dense_145 (Dense)            (None, 96)                90720     
_________________________________________________________________
dense_146 (Dense)            (None, 1)                 97        
=================================================================
Total params: 993,579
Trainable params: 993,579
Non-trainable params: 0
_________________________________________________________________
