Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_253 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_254 (Dense)            (None, 368)               249872    
_________________________________________________________________
dense_255 (Dense)            (None, 176)               64944     
_________________________________________________________________
dense_256 (Dense)            (None, 256)               45312     
_________________________________________________________________
dense_257 (Dense)            (None, 224)               57568     
_________________________________________________________________
dense_258 (Dense)            (None, 320)               72000     
_________________________________________________________________
dense_259 (Dense)            (None, 816)               261936    
_________________________________________________________________
dense_260 (Dense)            (None, 832)               679744    
_________________________________________________________________
dense_261 (Dense)            (None, 800)               666400    
_________________________________________________________________
dense_262 (Dense)            (None, 384)               307584    
_________________________________________________________________
dense_263 (Dense)            (None, 448)               172480    
_________________________________________________________________
dense_264 (Dense)            (None, 432)               193968    
_________________________________________________________________
dense_265 (Dense)            (None, 176)               76208     
_________________________________________________________________
dense_266 (Dense)            (None, 304)               53808     
_________________________________________________________________
dense_267 (Dense)            (None, 304)               92720     
_________________________________________________________________
dense_268 (Dense)            (None, 832)               253760    
_________________________________________________________________
dense_269 (Dense)            (None, 48)                39984     
_________________________________________________________________
dense_270 (Dense)            (None, 176)               8624      
_________________________________________________________________
dense_271 (Dense)            (None, 560)               99120     
_________________________________________________________________
dense_272 (Dense)            (None, 544)               305184    
_________________________________________________________________
dense_273 (Dense)            (None, 640)               348800    
_________________________________________________________________
dense_274 (Dense)            (None, 528)               338448    
_________________________________________________________________
dense_275 (Dense)            (None, 320)               169280    
_________________________________________________________________
dense_276 (Dense)            (None, 608)               195168    
_________________________________________________________________
dense_277 (Dense)            (None, 208)               126672    
_________________________________________________________________
dense_278 (Dense)            (None, 880)               183920    
_________________________________________________________________
dense_279 (Dense)            (None, 688)               606128    
_________________________________________________________________
dense_280 (Dense)            (None, 912)               628368    
_________________________________________________________________
dense_281 (Dense)            (None, 1)                 913       
=================================================================
Total params: 6,759,275
Trainable params: 6,759,275
Non-trainable params: 0
_________________________________________________________________
