Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_282 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_283 (Dense)            (None, 752)               510608    
_________________________________________________________________
dense_284 (Dense)            (None, 944)               710832    
_________________________________________________________________
dense_285 (Dense)            (None, 208)               196560    
_________________________________________________________________
dense_286 (Dense)            (None, 304)               63536     
_________________________________________________________________
dense_287 (Dense)            (None, 736)               224480    
_________________________________________________________________
dense_288 (Dense)            (None, 256)               188672    
_________________________________________________________________
dense_289 (Dense)            (None, 592)               152144    
_________________________________________________________________
dense_290 (Dense)            (None, 864)               512352    
_________________________________________________________________
dense_291 (Dense)            (None, 128)               110720    
_________________________________________________________________
dense_292 (Dense)            (None, 656)               84624     
_________________________________________________________________
dense_293 (Dense)            (None, 720)               473040    
_________________________________________________________________
dense_294 (Dense)            (None, 1)                 721       
=================================================================
Total params: 3,688,651
Trainable params: 3,688,651
Non-trainable params: 0
_________________________________________________________________
