Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_295 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_296 (Dense)            (None, 880)               597520    
_________________________________________________________________
dense_297 (Dense)            (None, 896)               789376    
_________________________________________________________________
dense_298 (Dense)            (None, 624)               559728    
_________________________________________________________________
dense_299 (Dense)            (None, 480)               300000    
_________________________________________________________________
dense_300 (Dense)            (None, 720)               346320    
_________________________________________________________________
dense_301 (Dense)            (None, 912)               657552    
_________________________________________________________________
dense_302 (Dense)            (None, 400)               365200    
_________________________________________________________________
dense_303 (Dense)            (None, 240)               96240     
_________________________________________________________________
dense_304 (Dense)            (None, 800)               192800    
_________________________________________________________________
dense_305 (Dense)            (None, 624)               499824    
_________________________________________________________________
dense_306 (Dense)            (None, 560)               350000    
_________________________________________________________________
dense_307 (Dense)            (None, 768)               430848    
_________________________________________________________________
dense_308 (Dense)            (None, 720)               553680    
_________________________________________________________________
dense_309 (Dense)            (None, 1008)              726768    
_________________________________________________________________
dense_310 (Dense)            (None, 512)               516608    
_________________________________________________________________
dense_311 (Dense)            (None, 128)               65664     
_________________________________________________________________
dense_312 (Dense)            (None, 784)               101136    
_________________________________________________________________
dense_313 (Dense)            (None, 1)                 785       
=================================================================
Total params: 7,610,411
Trainable params: 7,610,411
Non-trainable params: 0
_________________________________________________________________
