Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_45 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_46 (Dense)             (None, 112)               76048     
_________________________________________________________________
dense_47 (Dense)             (None, 848)               95824     
_________________________________________________________________
dense_48 (Dense)             (None, 928)               787872    
_________________________________________________________________
dense_49 (Dense)             (None, 656)               609424    
_________________________________________________________________
dense_50 (Dense)             (None, 608)               399456    
_________________________________________________________________
dense_51 (Dense)             (None, 256)               155904    
_________________________________________________________________
dense_52 (Dense)             (None, 592)               152144    
_________________________________________________________________
dense_53 (Dense)             (None, 672)               398496    
_________________________________________________________________
dense_54 (Dense)             (None, 192)               129216    
_________________________________________________________________
dense_55 (Dense)             (None, 352)               67936     
_________________________________________________________________
dense_56 (Dense)             (None, 240)               84720     
_________________________________________________________________
dense_57 (Dense)             (None, 192)               46272     
_________________________________________________________________
dense_58 (Dense)             (None, 160)               30880     
_________________________________________________________________
dense_59 (Dense)             (None, 48)                7728      
_________________________________________________________________
dense_60 (Dense)             (None, 1008)              49392     
_________________________________________________________________
dense_61 (Dense)             (None, 976)               984784    
_________________________________________________________________
dense_62 (Dense)             (None, 704)               687808    
_________________________________________________________________
dense_63 (Dense)             (None, 96)                67680     
_________________________________________________________________
dense_64 (Dense)             (None, 288)               27936     
_________________________________________________________________
dense_65 (Dense)             (None, 1)                 289       
=================================================================
Total params: 5,320,171
Trainable params: 5,320,171
Non-trainable params: 0
_________________________________________________________________
