Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_110 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_111 (Dense)            (None, 576)               391104    
_________________________________________________________________
dense_112 (Dense)            (None, 240)               138480    
_________________________________________________________________
dense_113 (Dense)            (None, 416)               100256    
_________________________________________________________________
dense_114 (Dense)            (None, 832)               346944    
_________________________________________________________________
dense_115 (Dense)            (None, 704)               586432    
_________________________________________________________________
dense_116 (Dense)            (None, 992)               699360    
_________________________________________________________________
dense_117 (Dense)            (None, 304)               301872    
_________________________________________________________________
dense_118 (Dense)            (None, 48)                14640     
_________________________________________________________________
dense_119 (Dense)            (None, 864)               42336     
_________________________________________________________________
dense_120 (Dense)            (None, 448)               387520    
_________________________________________________________________
dense_121 (Dense)            (None, 640)               287360    
_________________________________________________________________
dense_122 (Dense)            (None, 352)               225632    
_________________________________________________________________
dense_123 (Dense)            (None, 320)               112960    
_________________________________________________________________
dense_124 (Dense)            (None, 768)               246528    
_________________________________________________________________
dense_125 (Dense)            (None, 96)                73824     
_________________________________________________________________
dense_126 (Dense)            (None, 1)                 97        
=================================================================
Total params: 4,415,707
Trainable params: 4,415,707
Non-trainable params: 0
_________________________________________________________________
