Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_127 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_128 (Dense)            (None, 688)               467152    
_________________________________________________________________
dense_129 (Dense)            (None, 352)               242528    
_________________________________________________________________
dense_130 (Dense)            (None, 832)               293696    
_________________________________________________________________
dense_131 (Dense)            (None, 784)               653072    
_________________________________________________________________
dense_132 (Dense)            (None, 208)               163280    
_________________________________________________________________
dense_133 (Dense)            (None, 928)               193952    
_________________________________________________________________
dense_134 (Dense)            (None, 112)               104048    
_________________________________________________________________
dense_135 (Dense)            (None, 96)                10848     
_________________________________________________________________
dense_136 (Dense)            (None, 752)               72944     
_________________________________________________________________
dense_137 (Dense)            (None, 272)               204816    
_________________________________________________________________
dense_138 (Dense)            (None, 368)               100464    
_________________________________________________________________
dense_139 (Dense)            (None, 480)               177120    
_________________________________________________________________
dense_140 (Dense)            (None, 352)               169312    
_________________________________________________________________
dense_141 (Dense)            (None, 1)                 353       
=================================================================
Total params: 3,313,947
Trainable params: 3,313,947
Non-trainable params: 0
_________________________________________________________________
