Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_28 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_29 (Dense)             (None, 624)               423696    
_________________________________________________________________
dense_30 (Dense)             (None, 368)               230000    
_________________________________________________________________
dense_31 (Dense)             (None, 288)               106272    
_________________________________________________________________
dense_32 (Dense)             (None, 720)               208080    
_________________________________________________________________
dense_33 (Dense)             (None, 208)               149968    
_________________________________________________________________
dense_34 (Dense)             (None, 528)               110352    
_________________________________________________________________
dense_35 (Dense)             (None, 304)               160816    
_________________________________________________________________
dense_36 (Dense)             (None, 384)               117120    
_________________________________________________________________
dense_37 (Dense)             (None, 960)               369600    
_________________________________________________________________
dense_38 (Dense)             (None, 608)               584288    
_________________________________________________________________
dense_39 (Dense)             (None, 400)               243600    
_________________________________________________________________
dense_40 (Dense)             (None, 496)               198896    
_________________________________________________________________
dense_41 (Dense)             (None, 544)               270368    
_________________________________________________________________
dense_42 (Dense)             (None, 256)               139520    
_________________________________________________________________
dense_43 (Dense)             (None, 384)               98688     
_________________________________________________________________
dense_44 (Dense)             (None, 1)                 385       
=================================================================
Total params: 3,872,011
Trainable params: 3,872,011
Non-trainable params: 0
_________________________________________________________________
