Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_435 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_436 (Dense)            (None, 368)               249872    
_________________________________________________________________
dense_437 (Dense)            (None, 112)               41328     
_________________________________________________________________
dense_438 (Dense)            (None, 432)               48816     
_________________________________________________________________
dense_439 (Dense)            (None, 992)               429536    
_________________________________________________________________
dense_440 (Dense)            (None, 720)               714960    
_________________________________________________________________
dense_441 (Dense)            (None, 672)               484512    
_________________________________________________________________
dense_442 (Dense)            (None, 624)               419952    
_________________________________________________________________
dense_443 (Dense)            (None, 720)               450000    
_________________________________________________________________
dense_444 (Dense)            (None, 608)               438368    
_________________________________________________________________
dense_445 (Dense)            (None, 528)               321552    
_________________________________________________________________
dense_446 (Dense)            (None, 32)                16928     
_________________________________________________________________
dense_447 (Dense)            (None, 48)                1584      
_________________________________________________________________
dense_448 (Dense)            (None, 160)               7840      
_________________________________________________________________
dense_449 (Dense)            (None, 528)               85008     
_________________________________________________________________
dense_450 (Dense)            (None, 192)               101568    
_________________________________________________________________
dense_451 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_452 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_453 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_454 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_455 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_456 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_457 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_458 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_459 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_460 (Dense)            (None, 1)                 1         
=================================================================
Total params: 4,272,187
Trainable params: 4,272,187
Non-trainable params: 0
_________________________________________________________________
