Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_219 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_220 (Dense)            (None, 624)               423696    
_________________________________________________________________
dense_221 (Dense)            (None, 960)               600000    
_________________________________________________________________
dense_222 (Dense)            (None, 816)               784176    
_________________________________________________________________
dense_223 (Dense)            (None, 224)               183008    
_________________________________________________________________
dense_224 (Dense)            (None, 336)               75600     
_________________________________________________________________
dense_225 (Dense)            (None, 64)                21568     
_________________________________________________________________
dense_226 (Dense)            (None, 272)               17680     
_________________________________________________________________
dense_227 (Dense)            (None, 80)                21840     
_________________________________________________________________
dense_228 (Dense)            (None, 832)               67392     
_________________________________________________________________
dense_229 (Dense)            (None, 832)               693056    
_________________________________________________________________
dense_230 (Dense)            (None, 304)               253232    
_________________________________________________________________
dense_231 (Dense)            (None, 784)               239120    
_________________________________________________________________
dense_232 (Dense)            (None, 976)               766160    
_________________________________________________________________
dense_233 (Dense)            (None, 800)               781600    
_________________________________________________________________
dense_234 (Dense)            (None, 384)               307584    
_________________________________________________________________
dense_235 (Dense)            (None, 1008)              388080    
_________________________________________________________________
dense_236 (Dense)            (None, 400)               403600    
_________________________________________________________________
dense_237 (Dense)            (None, 1)                 401       
=================================================================
Total params: 6,488,155
Trainable params: 6,488,155
Non-trainable params: 0
_________________________________________________________________
