Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_461 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_462 (Dense)            (None, 144)               97776     
_________________________________________________________________
dense_463 (Dense)            (None, 1008)              146160    
_________________________________________________________________
dense_464 (Dense)            (None, 848)               855632    
_________________________________________________________________
dense_465 (Dense)            (None, 992)               842208    
_________________________________________________________________
dense_466 (Dense)            (None, 288)               285984    
_________________________________________________________________
dense_467 (Dense)            (None, 544)               157216    
_________________________________________________________________
dense_468 (Dense)            (None, 80)                43600     
_________________________________________________________________
dense_469 (Dense)            (None, 576)               46656     
_________________________________________________________________
dense_470 (Dense)            (None, 1024)              590848    
_________________________________________________________________
dense_471 (Dense)            (None, 512)               524800    
_________________________________________________________________
dense_472 (Dense)            (None, 336)               172368    
_________________________________________________________________
dense_473 (Dense)            (None, 48)                16176     
_________________________________________________________________
dense_474 (Dense)            (None, 320)               15680     
_________________________________________________________________
dense_475 (Dense)            (None, 384)               123264    
_________________________________________________________________
dense_476 (Dense)            (None, 144)               55440     
_________________________________________________________________
dense_477 (Dense)            (None, 464)               67280     
_________________________________________________________________
dense_478 (Dense)            (None, 896)               416640    
_________________________________________________________________
dense_479 (Dense)            (None, 768)               688896    
_________________________________________________________________
dense_480 (Dense)            (None, 448)               344512    
_________________________________________________________________
dense_481 (Dense)            (None, 576)               258624    
_________________________________________________________________
dense_482 (Dense)            (None, 624)               360048    
_________________________________________________________________
dense_483 (Dense)            (None, 48)                30000     
_________________________________________________________________
dense_484 (Dense)            (None, 496)               24304     
_________________________________________________________________
dense_485 (Dense)            (None, 992)               493024    
_________________________________________________________________
dense_486 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_487 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_488 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_489 (Dense)            (None, 1)                 1         
=================================================================
Total params: 7,117,499
Trainable params: 7,117,499
Non-trainable params: 0
_________________________________________________________________
