Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_70 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_71 (Dense)             (None, 544)               369376    
_________________________________________________________________
dense_72 (Dense)             (None, 160)               87200     
_________________________________________________________________
dense_73 (Dense)             (None, 800)               128800    
_________________________________________________________________
dense_74 (Dense)             (None, 544)               435744    
_________________________________________________________________
dense_75 (Dense)             (None, 352)               191840    
_________________________________________________________________
dense_76 (Dense)             (None, 176)               62128     
_________________________________________________________________
dense_77 (Dense)             (None, 144)               25488     
_________________________________________________________________
dense_78 (Dense)             (None, 496)               71920     
_________________________________________________________________
dense_79 (Dense)             (None, 912)               453264    
_________________________________________________________________
dense_80 (Dense)             (None, 672)               613536    
_________________________________________________________________
dense_81 (Dense)             (None, 528)               355344    
_________________________________________________________________
dense_82 (Dense)             (None, 624)               330096    
_________________________________________________________________
dense_83 (Dense)             (None, 224)               140000    
_________________________________________________________________
dense_84 (Dense)             (None, 1008)              226800    
_________________________________________________________________
dense_85 (Dense)             (None, 736)               742624    
_________________________________________________________________
dense_86 (Dense)             (None, 128)               94336     
_________________________________________________________________
dense_87 (Dense)             (None, 304)               39216     
_________________________________________________________________
dense_88 (Dense)             (None, 240)               73200     
_________________________________________________________________
dense_89 (Dense)             (None, 1024)              246784    
_________________________________________________________________
dense_90 (Dense)             (None, 752)               770800    
_________________________________________________________________
dense_91 (Dense)             (None, 496)               373488    
_________________________________________________________________
dense_92 (Dense)             (None, 1)                 497       
=================================================================
Total params: 6,292,843
Trainable params: 6,292,843
Non-trainable params: 0
_________________________________________________________________
