Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_390 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_391 (Dense)            (None, 624)               423696    
_________________________________________________________________
dense_392 (Dense)            (None, 464)               290000    
_________________________________________________________________
dense_393 (Dense)            (None, 48)                22320     
_________________________________________________________________
dense_394 (Dense)            (None, 224)               10976     
_________________________________________________________________
dense_395 (Dense)            (None, 832)               187200    
_________________________________________________________________
dense_396 (Dense)            (None, 992)               826336    
_________________________________________________________________
dense_397 (Dense)            (None, 896)               889728    
_________________________________________________________________
dense_398 (Dense)            (None, 752)               674544    
_________________________________________________________________
dense_399 (Dense)            (None, 944)               710832    
_________________________________________________________________
dense_400 (Dense)            (None, 208)               196560    
_________________________________________________________________
dense_401 (Dense)            (None, 752)               157168    
_________________________________________________________________
dense_402 (Dense)            (None, 112)               84336     
_________________________________________________________________
dense_403 (Dense)            (None, 560)               63280     
_________________________________________________________________
dense_404 (Dense)            (None, 448)               251328    
_________________________________________________________________
dense_405 (Dense)            (None, 800)               359200    
_________________________________________________________________
dense_406 (Dense)            (None, 96)                76896     
_________________________________________________________________
dense_407 (Dense)            (None, 1008)              97776     
_________________________________________________________________
dense_408 (Dense)            (None, 96)                96864     
_________________________________________________________________
dense_409 (Dense)            (None, 576)               55872     
_________________________________________________________________
dense_410 (Dense)            (None, 96)                55392     
_________________________________________________________________
dense_411 (Dense)            (None, 64)                6208      
_________________________________________________________________
dense_412 (Dense)            (None, 592)               38480     
_________________________________________________________________
dense_413 (Dense)            (None, 416)               246688    
_________________________________________________________________
dense_414 (Dense)            (None, 912)               380304    
_________________________________________________________________
dense_415 (Dense)            (None, 272)               248336    
_________________________________________________________________
dense_416 (Dense)            (None, 272)               74256     
_________________________________________________________________
dense_417 (Dense)            (None, 1)                 273       
=================================================================
Total params: 6,985,211
Trainable params: 6,985,211
Non-trainable params: 0
_________________________________________________________________
