Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_172 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_173 (Dense)            (None, 400)               271600    
_________________________________________________________________
dense_174 (Dense)            (None, 304)               121904    
_________________________________________________________________
dense_175 (Dense)            (None, 304)               92720     
_________________________________________________________________
dense_176 (Dense)            (None, 912)               278160    
_________________________________________________________________
dense_177 (Dense)            (None, 848)               774224    
_________________________________________________________________
dense_178 (Dense)            (None, 1)                 849       
=================================================================
Total params: 1,999,819
Trainable params: 1,999,819
Non-trainable params: 0
_________________________________________________________________
