Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_238 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_239 (Dense)            (None, 592)               401968    
_________________________________________________________________
dense_240 (Dense)            (None, 64)                37952     
_________________________________________________________________
dense_241 (Dense)            (None, 736)               47840     
_________________________________________________________________
dense_242 (Dense)            (None, 480)               353760    
_________________________________________________________________
dense_243 (Dense)            (None, 1008)              484848    
_________________________________________________________________
dense_244 (Dense)            (None, 368)               371312    
_________________________________________________________________
dense_245 (Dense)            (None, 1008)              371952    
_________________________________________________________________
dense_246 (Dense)            (None, 736)               742624    
_________________________________________________________________
dense_247 (Dense)            (None, 864)               636768    
_________________________________________________________________
dense_248 (Dense)            (None, 752)               650480    
_________________________________________________________________
dense_249 (Dense)            (None, 640)               481920    
_________________________________________________________________
dense_250 (Dense)            (None, 224)               143584    
_________________________________________________________________
dense_251 (Dense)            (None, 112)               25200     
_________________________________________________________________
dense_252 (Dense)            (None, 1)                 113       
=================================================================
Total params: 5,210,683
Trainable params: 5,210,683
Non-trainable params: 0
_________________________________________________________________
