Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_179 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_180 (Dense)            (None, 960)               651840    
_________________________________________________________________
dense_181 (Dense)            (None, 272)               261392    
_________________________________________________________________
dense_182 (Dense)            (None, 704)               192192    
_________________________________________________________________
dense_183 (Dense)            (None, 272)               191760    
_________________________________________________________________
dense_184 (Dense)            (None, 64)                17472     
_________________________________________________________________
dense_185 (Dense)            (None, 528)               34320     
_________________________________________________________________
dense_186 (Dense)            (None, 512)               270848    
_________________________________________________________________
dense_187 (Dense)            (None, 880)               451440    
_________________________________________________________________
dense_188 (Dense)            (None, 416)               366496    
_________________________________________________________________
dense_189 (Dense)            (None, 560)               233520    
_________________________________________________________________
dense_190 (Dense)            (None, 560)               314160    
_________________________________________________________________
dense_191 (Dense)            (None, 128)               71808     
_________________________________________________________________
dense_192 (Dense)            (None, 448)               57792     
_________________________________________________________________
dense_193 (Dense)            (None, 528)               237072    
_________________________________________________________________
dense_194 (Dense)            (None, 960)               507840    
_________________________________________________________________
dense_195 (Dense)            (None, 480)               461280    
_________________________________________________________________
dense_196 (Dense)            (None, 416)               200096    
_________________________________________________________________
dense_197 (Dense)            (None, 816)               340272    
_________________________________________________________________
dense_198 (Dense)            (None, 416)               339872    
_________________________________________________________________
dense_199 (Dense)            (None, 288)               120096    
_________________________________________________________________
dense_200 (Dense)            (None, 176)               50864     
_________________________________________________________________
dense_201 (Dense)            (None, 992)               175584    
_________________________________________________________________
dense_202 (Dense)            (None, 1)                 993       
=================================================================
Total params: 6,009,371
Trainable params: 6,009,371
Non-trainable params: 0
_________________________________________________________________
