Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_147 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_148 (Dense)            (None, 928)               630112    
_________________________________________________________________
dense_149 (Dense)            (None, 480)               445920    
_________________________________________________________________
dense_150 (Dense)            (None, 592)               284752    
_________________________________________________________________
dense_151 (Dense)            (None, 640)               379520    
_________________________________________________________________
dense_152 (Dense)            (None, 368)               235888    
_________________________________________________________________
dense_153 (Dense)            (None, 560)               206640    
_________________________________________________________________
dense_154 (Dense)            (None, 336)               188496    
_________________________________________________________________
dense_155 (Dense)            (None, 704)               237248    
_________________________________________________________________
dense_156 (Dense)            (None, 112)               78960     
_________________________________________________________________
dense_157 (Dense)            (None, 736)               83168     
_________________________________________________________________
dense_158 (Dense)            (None, 768)               566016    
_________________________________________________________________
dense_159 (Dense)            (None, 528)               406032    
_________________________________________________________________
dense_160 (Dense)            (None, 848)               448592    
_________________________________________________________________
dense_161 (Dense)            (None, 528)               448272    
_________________________________________________________________
dense_162 (Dense)            (None, 144)               76176     
_________________________________________________________________
dense_163 (Dense)            (None, 816)               118320    
_________________________________________________________________
dense_164 (Dense)            (None, 800)               653600    
_________________________________________________________________
dense_165 (Dense)            (None, 928)               743328    
_________________________________________________________________
dense_166 (Dense)            (None, 128)               118912    
_________________________________________________________________
dense_167 (Dense)            (None, 416)               53664     
_________________________________________________________________
dense_168 (Dense)            (None, 224)               93408     
_________________________________________________________________
dense_169 (Dense)            (None, 48)                10800     
_________________________________________________________________
dense_170 (Dense)            (None, 816)               39984     
_________________________________________________________________
dense_171 (Dense)            (None, 1)                 817       
=================================================================
Total params: 7,008,987
Trainable params: 7,008,987
Non-trainable params: 0
_________________________________________________________________
