Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_203 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_204 (Dense)            (None, 960)               651840    
_________________________________________________________________
dense_205 (Dense)            (None, 816)               784176    
_________________________________________________________________
dense_206 (Dense)            (None, 656)               535952    
_________________________________________________________________
dense_207 (Dense)            (None, 96)                63072     
_________________________________________________________________
dense_208 (Dense)            (None, 960)               93120     
_________________________________________________________________
dense_209 (Dense)            (None, 736)               707296    
_________________________________________________________________
dense_210 (Dense)            (None, 96)                70752     
_________________________________________________________________
dense_211 (Dense)            (None, 176)               17072     
_________________________________________________________________
dense_212 (Dense)            (None, 688)               121776    
_________________________________________________________________
dense_213 (Dense)            (None, 848)               584272    
_________________________________________________________________
dense_214 (Dense)            (None, 800)               679200    
_________________________________________________________________
dense_215 (Dense)            (None, 112)               89712     
_________________________________________________________________
dense_216 (Dense)            (None, 544)               61472     
_________________________________________________________________
dense_217 (Dense)            (None, 96)                52320     
_________________________________________________________________
dense_218 (Dense)            (None, 1)                 97        
=================================================================
Total params: 4,972,491
Trainable params: 4,972,491
Non-trainable params: 0
_________________________________________________________________
