Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_368 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_369 (Dense)            (None, 448)               304192    
_________________________________________________________________
dense_370 (Dense)            (None, 128)               57472     
_________________________________________________________________
dense_371 (Dense)            (None, 400)               51600     
_________________________________________________________________
dense_372 (Dense)            (None, 752)               301552    
_________________________________________________________________
dense_373 (Dense)            (None, 304)               228912    
_________________________________________________________________
dense_374 (Dense)            (None, 688)               209840    
_________________________________________________________________
dense_375 (Dense)            (None, 944)               650416    
_________________________________________________________________
dense_376 (Dense)            (None, 368)               347760    
_________________________________________________________________
dense_377 (Dense)            (None, 512)               188928    
_________________________________________________________________
dense_378 (Dense)            (None, 864)               443232    
_________________________________________________________________
dense_379 (Dense)            (None, 560)               484400    
_________________________________________________________________
dense_380 (Dense)            (None, 720)               403920    
_________________________________________________________________
dense_381 (Dense)            (None, 1008)              726768    
_________________________________________________________________
dense_382 (Dense)            (None, 864)               871776    
_________________________________________________________________
dense_383 (Dense)            (None, 336)               290640    
_________________________________________________________________
dense_384 (Dense)            (None, 992)               334304    
_________________________________________________________________
dense_385 (Dense)            (None, 880)               873840    
_________________________________________________________________
dense_386 (Dense)            (None, 464)               408784    
_________________________________________________________________
dense_387 (Dense)            (None, 784)               364560    
_________________________________________________________________
dense_388 (Dense)            (None, 912)               715920    
_________________________________________________________________
dense_389 (Dense)            (None, 1)                 913       
=================================================================
Total params: 8,720,091
Trainable params: 8,720,091
Non-trainable params: 0
_________________________________________________________________
