Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_93 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_94 (Dense)             (None, 64)                43456     
_________________________________________________________________
dense_95 (Dense)             (None, 976)               63440     
_________________________________________________________________
dense_96 (Dense)             (None, 384)               375168    
_________________________________________________________________
dense_97 (Dense)             (None, 128)               49280     
_________________________________________________________________
dense_98 (Dense)             (None, 528)               68112     
_________________________________________________________________
dense_99 (Dense)             (None, 224)               118496    
_________________________________________________________________
dense_100 (Dense)            (None, 912)               205200    
_________________________________________________________________
dense_101 (Dense)            (None, 336)               306768    
_________________________________________________________________
dense_102 (Dense)            (None, 416)               140192    
_________________________________________________________________
dense_103 (Dense)            (None, 528)               220176    
_________________________________________________________________
dense_104 (Dense)            (None, 112)               59248     
_________________________________________________________________
dense_105 (Dense)            (None, 752)               84976     
_________________________________________________________________
dense_106 (Dense)            (None, 480)               361440    
_________________________________________________________________
dense_107 (Dense)            (None, 848)               407888    
_________________________________________________________________
dense_108 (Dense)            (None, 64)                54336     
_________________________________________________________________
dense_109 (Dense)            (None, 1)                 65        
=================================================================
Total params: 3,018,603
Trainable params: 3,018,603
Non-trainable params: 0
_________________________________________________________________
