Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_340 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_341 (Dense)            (None, 640)               434560    
_________________________________________________________________
dense_342 (Dense)            (None, 416)               266656    
_________________________________________________________________
dense_343 (Dense)            (None, 448)               186816    
_________________________________________________________________
dense_344 (Dense)            (None, 464)               208336    
_________________________________________________________________
dense_345 (Dense)            (None, 256)               119040    
_________________________________________________________________
dense_346 (Dense)            (None, 464)               119248    
_________________________________________________________________
dense_347 (Dense)            (None, 128)               59520     
_________________________________________________________________
dense_348 (Dense)            (None, 336)               43344     
_________________________________________________________________
dense_349 (Dense)            (None, 80)                26960     
_________________________________________________________________
dense_350 (Dense)            (None, 304)               24624     
_________________________________________________________________
dense_351 (Dense)            (None, 128)               39040     
_________________________________________________________________
dense_352 (Dense)            (None, 928)               119712    
_________________________________________________________________
dense_353 (Dense)            (None, 816)               758064    
_________________________________________________________________
dense_354 (Dense)            (None, 1008)              823536    
_________________________________________________________________
dense_355 (Dense)            (None, 512)               516608    
_________________________________________________________________
dense_356 (Dense)            (None, 288)               147744    
_________________________________________________________________
dense_357 (Dense)            (None, 944)               272816    
_________________________________________________________________
dense_358 (Dense)            (None, 160)               151200    
_________________________________________________________________
dense_359 (Dense)            (None, 608)               97888     
_________________________________________________________________
dense_360 (Dense)            (None, 240)               146160    
_________________________________________________________________
dense_361 (Dense)            (None, 464)               111824    
_________________________________________________________________
dense_362 (Dense)            (None, 496)               230640    
_________________________________________________________________
dense_363 (Dense)            (None, 400)               198800    
_________________________________________________________________
dense_364 (Dense)            (None, 512)               205312    
_________________________________________________________________
dense_365 (Dense)            (None, 784)               402192    
_________________________________________________________________
dense_366 (Dense)            (None, 416)               326560    
_________________________________________________________________
dense_367 (Dense)            (None, 1)                 417       
=================================================================
Total params: 6,497,979
Trainable params: 6,497,979
Non-trainable params: 0
_________________________________________________________________
