Model: "sequential_22"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_418 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_419 (Dense)            (None, 304)               206416    
_________________________________________________________________
dense_420 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_421 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_422 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_423 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_424 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_425 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_426 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_427 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_428 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_429 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_430 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_431 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_432 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_433 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_434 (Dense)            (None, 1)                 1         
=================================================================
Total params: 666,779
Trainable params: 666,779
Non-trainable params: 0
_________________________________________________________________
