Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_66 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_67 (Dense)             (None, 640)               434560    
_________________________________________________________________
dense_68 (Dense)             (None, 752)               482032    
_________________________________________________________________
dense_69 (Dense)             (None, 1)                 753       
=================================================================
Total params: 1,377,707
Trainable params: 1,377,707
Non-trainable params: 0
_________________________________________________________________
