Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_314 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_315 (Dense)            (None, 384)               260736    
_________________________________________________________________
dense_316 (Dense)            (None, 816)               314160    
_________________________________________________________________
dense_317 (Dense)            (None, 896)               732032    
_________________________________________________________________
dense_318 (Dense)            (None, 448)               401856    
_________________________________________________________________
dense_319 (Dense)            (None, 160)               71840     
_________________________________________________________________
dense_320 (Dense)            (None, 464)               74704     
_________________________________________________________________
dense_321 (Dense)            (None, 208)               96720     
_________________________________________________________________
dense_322 (Dense)            (None, 1008)              210672    
_________________________________________________________________
dense_323 (Dense)            (None, 416)               419744    
_________________________________________________________________
dense_324 (Dense)            (None, 592)               246864    
_________________________________________________________________
dense_325 (Dense)            (None, 736)               436448    
_________________________________________________________________
dense_326 (Dense)            (None, 816)               601392    
_________________________________________________________________
dense_327 (Dense)            (None, 880)               718960    
_________________________________________________________________
dense_328 (Dense)            (None, 880)               775280    
_________________________________________________________________
dense_329 (Dense)            (None, 496)               436976    
_________________________________________________________________
dense_330 (Dense)            (None, 816)               405552    
_________________________________________________________________
dense_331 (Dense)            (None, 432)               352944    
_________________________________________________________________
dense_332 (Dense)            (None, 624)               270192    
_________________________________________________________________
dense_333 (Dense)            (None, 256)               160000    
_________________________________________________________________
dense_334 (Dense)            (None, 288)               74016     
_________________________________________________________________
dense_335 (Dense)            (None, 848)               245072    
_________________________________________________________________
dense_336 (Dense)            (None, 64)                54336     
_________________________________________________________________
dense_337 (Dense)            (None, 688)               44720     
_________________________________________________________________
dense_338 (Dense)            (None, 320)               220480    
_________________________________________________________________
dense_339 (Dense)            (None, 1)                 321       
=================================================================
Total params: 8,086,379
Trainable params: 8,086,379
Non-trainable params: 0
_________________________________________________________________
