Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_388 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_389 (Dense)            (None, 576)               391104    
_________________________________________________________________
dense_390 (Dense)            (None, 464)               267728    
_________________________________________________________________
dense_391 (Dense)            (None, 64)                29760     
_________________________________________________________________
dense_392 (Dense)            (None, 224)               14560     
_________________________________________________________________
dense_393 (Dense)            (None, 544)               122400    
_________________________________________________________________
dense_394 (Dense)            (None, 368)               200560    
_________________________________________________________________
dense_395 (Dense)            (None, 240)               88560     
_________________________________________________________________
dense_396 (Dense)            (None, 784)               188944    
_________________________________________________________________
dense_397 (Dense)            (None, 144)               113040    
_________________________________________________________________
dense_398 (Dense)            (None, 32)                4640      
_________________________________________________________________
dense_399 (Dense)            (None, 208)               6864      
_________________________________________________________________
dense_400 (Dense)            (None, 688)               143792    
_________________________________________________________________
dense_401 (Dense)            (None, 704)               485056    
_________________________________________________________________
dense_402 (Dense)            (None, 496)               349680    
_________________________________________________________________
dense_403 (Dense)            (None, 352)               174944    
_________________________________________________________________
dense_404 (Dense)            (None, 496)               175088    
_________________________________________________________________
dense_405 (Dense)            (None, 416)               206752    
_________________________________________________________________
dense_406 (Dense)            (None, 672)               280224    
_________________________________________________________________
dense_407 (Dense)            (None, 288)               193824    
_________________________________________________________________
dense_408 (Dense)            (None, 1024)              295936    
_________________________________________________________________
dense_409 (Dense)            (None, 848)               869200    
_________________________________________________________________
dense_410 (Dense)            (None, 256)               217344    
_________________________________________________________________
dense_411 (Dense)            (None, 64)                16448     
_________________________________________________________________
dense_412 (Dense)            (None, 1024)              66560     
_________________________________________________________________
dense_413 (Dense)            (None, 832)               852800    
_________________________________________________________________
dense_414 (Dense)            (None, 400)               333200    
_________________________________________________________________
dense_415 (Dense)            (None, 864)               346464    
_________________________________________________________________
dense_416 (Dense)            (None, 288)               249120    
_________________________________________________________________
dense_417 (Dense)            (None, 752)               217328    
_________________________________________________________________
dense_418 (Dense)            (None, 1)                 753       
=================================================================
Total params: 7,363,035
Trainable params: 7,363,035
Non-trainable params: 0
_________________________________________________________________
