Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_451 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_452 (Dense)            (None, 400)               271600    
_________________________________________________________________
dense_453 (Dense)            (None, 144)               57744     
_________________________________________________________________
dense_454 (Dense)            (None, 960)               139200    
_________________________________________________________________
dense_455 (Dense)            (None, 64)                61504     
_________________________________________________________________
dense_456 (Dense)            (None, 336)               21840     
_________________________________________________________________
dense_457 (Dense)            (None, 528)               177936    
_________________________________________________________________
dense_458 (Dense)            (None, 848)               448592    
_________________________________________________________________
dense_459 (Dense)            (None, 272)               230928    
_________________________________________________________________
dense_460 (Dense)            (None, 112)               30576     
_________________________________________________________________
dense_461 (Dense)            (None, 80)                9040      
_________________________________________________________________
dense_462 (Dense)            (None, 448)               36288     
_________________________________________________________________
dense_463 (Dense)            (None, 688)               308912    
_________________________________________________________________
dense_464 (Dense)            (None, 816)               562224    
_________________________________________________________________
dense_465 (Dense)            (None, 848)               692816    
_________________________________________________________________
dense_466 (Dense)            (None, 176)               149424    
_________________________________________________________________
dense_467 (Dense)            (None, 240)               42480     
_________________________________________________________________
dense_468 (Dense)            (None, 320)               77120     
_________________________________________________________________
dense_469 (Dense)            (None, 848)               272208    
_________________________________________________________________
dense_470 (Dense)            (None, 448)               380352    
_________________________________________________________________
dense_471 (Dense)            (None, 800)               359200    
_________________________________________________________________
dense_472 (Dense)            (None, 288)               230688    
_________________________________________________________________
dense_473 (Dense)            (None, 960)               277440    
_________________________________________________________________
dense_474 (Dense)            (None, 352)               338272    
_________________________________________________________________
dense_475 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_476 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_477 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_478 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_479 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_480 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_481 (Dense)            (None, 1)                 1         
=================================================================
Total params: 5,636,747
Trainable params: 5,636,747
Non-trainable params: 0
_________________________________________________________________
