Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_148 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_149 (Dense)            (None, 1008)              684432    
_________________________________________________________________
dense_150 (Dense)            (None, 448)               452032    
_________________________________________________________________
dense_151 (Dense)            (None, 944)               423856    
_________________________________________________________________
dense_152 (Dense)            (None, 528)               498960    
_________________________________________________________________
dense_153 (Dense)            (None, 688)               363952    
_________________________________________________________________
dense_154 (Dense)            (None, 816)               562224    
_________________________________________________________________
dense_155 (Dense)            (None, 368)               300656    
_________________________________________________________________
dense_156 (Dense)            (None, 144)               53136     
_________________________________________________________________
dense_157 (Dense)            (None, 560)               81200     
_________________________________________________________________
dense_158 (Dense)            (None, 976)               547536    
_________________________________________________________________
dense_159 (Dense)            (None, 896)               875392    
_________________________________________________________________
dense_160 (Dense)            (None, 832)               746304    
_________________________________________________________________
dense_161 (Dense)            (None, 176)               146608    
_________________________________________________________________
dense_162 (Dense)            (None, 1008)              178416    
_________________________________________________________________
dense_163 (Dense)            (None, 96)                96864     
_________________________________________________________________
dense_164 (Dense)            (None, 976)               94672     
_________________________________________________________________
dense_165 (Dense)            (None, 208)               203216    
_________________________________________________________________
dense_166 (Dense)            (None, 944)               197296    
_________________________________________________________________
dense_167 (Dense)            (None, 496)               468720    
_________________________________________________________________
dense_168 (Dense)            (None, 1)                 497       
=================================================================
Total params: 7,436,331
Trainable params: 7,436,331
Non-trainable params: 0
_________________________________________________________________
