Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_332 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_333 (Dense)            (None, 912)               619248    
_________________________________________________________________
dense_334 (Dense)            (None, 544)               496672    
_________________________________________________________________
dense_335 (Dense)            (None, 480)               261600    
_________________________________________________________________
dense_336 (Dense)            (None, 128)               61568     
_________________________________________________________________
dense_337 (Dense)            (None, 496)               63984     
_________________________________________________________________
dense_338 (Dense)            (None, 336)               166992    
_________________________________________________________________
dense_339 (Dense)            (None, 592)               199504    
_________________________________________________________________
dense_340 (Dense)            (None, 832)               493376    
_________________________________________________________________
dense_341 (Dense)            (None, 48)                39984     
_________________________________________________________________
dense_342 (Dense)            (None, 560)               27440     
_________________________________________________________________
dense_343 (Dense)            (None, 432)               242352    
_________________________________________________________________
dense_344 (Dense)            (None, 240)               103920    
_________________________________________________________________
dense_345 (Dense)            (None, 64)                15424     
_________________________________________________________________
dense_346 (Dense)            (None, 656)               42640     
_________________________________________________________________
dense_347 (Dense)            (None, 144)               94608     
_________________________________________________________________
dense_348 (Dense)            (None, 944)               136880    
_________________________________________________________________
dense_349 (Dense)            (None, 640)               604800    
_________________________________________________________________
dense_350 (Dense)            (None, 448)               287168    
_________________________________________________________________
dense_351 (Dense)            (None, 560)               251440    
_________________________________________________________________
dense_352 (Dense)            (None, 1)                 561       
=================================================================
Total params: 4,670,523
Trainable params: 4,670,523
Non-trainable params: 0
_________________________________________________________________
