Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_307 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_308 (Dense)            (None, 176)               119504    
_________________________________________________________________
dense_309 (Dense)            (None, 608)               107616    
_________________________________________________________________
dense_310 (Dense)            (None, 144)               87696     
_________________________________________________________________
dense_311 (Dense)            (None, 224)               32480     
_________________________________________________________________
dense_312 (Dense)            (None, 1)                 225       
=================================================================
Total params: 807,883
Trainable params: 807,883
Non-trainable params: 0
_________________________________________________________________
