Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_134 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_135 (Dense)            (None, 352)               239008    
_________________________________________________________________
dense_136 (Dense)            (None, 448)               158144    
_________________________________________________________________
dense_137 (Dense)            (None, 192)               86208     
_________________________________________________________________
dense_138 (Dense)            (None, 192)               37056     
_________________________________________________________________
dense_139 (Dense)            (None, 288)               55584     
_________________________________________________________________
dense_140 (Dense)            (None, 624)               180336    
_________________________________________________________________
dense_141 (Dense)            (None, 304)               190000    
_________________________________________________________________
dense_142 (Dense)            (None, 992)               302560    
_________________________________________________________________
dense_143 (Dense)            (None, 608)               603744    
_________________________________________________________________
dense_144 (Dense)            (None, 224)               136416    
_________________________________________________________________
dense_145 (Dense)            (None, 384)               86400     
_________________________________________________________________
dense_146 (Dense)            (None, 1008)              388080    
_________________________________________________________________
dense_147 (Dense)            (None, 1)                 1009      
=================================================================
Total params: 2,924,907
Trainable params: 2,924,907
Non-trainable params: 0
_________________________________________________________________
