Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_353 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_354 (Dense)            (None, 944)               640976    
_________________________________________________________________
dense_355 (Dense)            (None, 1024)              967680    
_________________________________________________________________
dense_356 (Dense)            (None, 432)               442800    
_________________________________________________________________
dense_357 (Dense)            (None, 1)                 433       
=================================================================
Total params: 2,512,251
Trainable params: 2,512,251
Non-trainable params: 0
_________________________________________________________________
