Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_115 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_116 (Dense)            (None, 528)               358512    
_________________________________________________________________
dense_117 (Dense)            (None, 240)               126960    
_________________________________________________________________
dense_118 (Dense)            (None, 608)               146528    
_________________________________________________________________
dense_119 (Dense)            (None, 896)               545664    
_________________________________________________________________
dense_120 (Dense)            (None, 688)               617136    
_________________________________________________________________
dense_121 (Dense)            (None, 672)               463008    
_________________________________________________________________
dense_122 (Dense)            (None, 80)                53840     
_________________________________________________________________
dense_123 (Dense)            (None, 128)               10368     
_________________________________________________________________
dense_124 (Dense)            (None, 416)               53664     
_________________________________________________________________
dense_125 (Dense)            (None, 864)               360288    
_________________________________________________________________
dense_126 (Dense)            (None, 32)                27680     
_________________________________________________________________
dense_127 (Dense)            (None, 848)               27984     
_________________________________________________________________
dense_128 (Dense)            (None, 608)               516192    
_________________________________________________________________
dense_129 (Dense)            (None, 832)               506688    
_________________________________________________________________
dense_130 (Dense)            (None, 432)               359856    
_________________________________________________________________
dense_131 (Dense)            (None, 944)               408752    
_________________________________________________________________
dense_132 (Dense)            (None, 272)               257040    
_________________________________________________________________
dense_133 (Dense)            (None, 1)                 273       
=================================================================
Total params: 5,300,795
Trainable params: 5,300,795
Non-trainable params: 0
_________________________________________________________________
