Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_426 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_427 (Dense)            (None, 272)               184688    
_________________________________________________________________
dense_428 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_429 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_430 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_431 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_432 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_433 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_434 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_435 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_436 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_437 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_438 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_439 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_440 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_441 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_442 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_443 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_444 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_445 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_446 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_447 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_448 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_449 (Dense)            (None, 0)                 0         
_________________________________________________________________
dense_450 (Dense)            (None, 1)                 1         
=================================================================
Total params: 645,051
Trainable params: 645,051
Non-trainable params: 0
_________________________________________________________________
