Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_251 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_252 (Dense)            (None, 448)               304192    
_________________________________________________________________
dense_253 (Dense)            (None, 448)               201152    
_________________________________________________________________
dense_254 (Dense)            (None, 288)               129312    
_________________________________________________________________
dense_255 (Dense)            (None, 32)                9248      
_________________________________________________________________
dense_256 (Dense)            (None, 880)               29040     
_________________________________________________________________
dense_257 (Dense)            (None, 224)               197344    
_________________________________________________________________
dense_258 (Dense)            (None, 608)               136800    
_________________________________________________________________
dense_259 (Dense)            (None, 256)               155904    
_________________________________________________________________
dense_260 (Dense)            (None, 448)               115136    
_________________________________________________________________
dense_261 (Dense)            (None, 720)               323280    
_________________________________________________________________
dense_262 (Dense)            (None, 336)               242256    
_________________________________________________________________
dense_263 (Dense)            (None, 256)               86272     
_________________________________________________________________
dense_264 (Dense)            (None, 448)               115136    
_________________________________________________________________
dense_265 (Dense)            (None, 336)               150864    
_________________________________________________________________
dense_266 (Dense)            (None, 96)                32352     
_________________________________________________________________
dense_267 (Dense)            (None, 784)               76048     
_________________________________________________________________
dense_268 (Dense)            (None, 352)               276320    
_________________________________________________________________
dense_269 (Dense)            (None, 784)               276752    
_________________________________________________________________
dense_270 (Dense)            (None, 544)               427040    
_________________________________________________________________
dense_271 (Dense)            (None, 784)               427280    
_________________________________________________________________
dense_272 (Dense)            (None, 1)                 785       
=================================================================
Total params: 4,172,875
Trainable params: 4,172,875
Non-trainable params: 0
_________________________________________________________________
