Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_313 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_314 (Dense)            (None, 144)               97776     
_________________________________________________________________
dense_315 (Dense)            (None, 528)               76560     
_________________________________________________________________
dense_316 (Dense)            (None, 944)               499376    
_________________________________________________________________
dense_317 (Dense)            (None, 400)               378000    
_________________________________________________________________
dense_318 (Dense)            (None, 400)               160400    
_________________________________________________________________
dense_319 (Dense)            (None, 80)                32080     
_________________________________________________________________
dense_320 (Dense)            (None, 736)               59616     
_________________________________________________________________
dense_321 (Dense)            (None, 128)               94336     
_________________________________________________________________
dense_322 (Dense)            (None, 64)                8256      
_________________________________________________________________
dense_323 (Dense)            (None, 912)               59280     
_________________________________________________________________
dense_324 (Dense)            (None, 624)               569712    
_________________________________________________________________
dense_325 (Dense)            (None, 928)               580000    
_________________________________________________________________
dense_326 (Dense)            (None, 192)               178368    
_________________________________________________________________
dense_327 (Dense)            (None, 160)               30880     
_________________________________________________________________
dense_328 (Dense)            (None, 496)               79856     
_________________________________________________________________
dense_329 (Dense)            (None, 400)               198800    
_________________________________________________________________
dense_330 (Dense)            (None, 240)               96240     
_________________________________________________________________
dense_331 (Dense)            (None, 1)                 241       
=================================================================
Total params: 3,660,139
Trainable params: 3,660,139
Non-trainable params: 0
_________________________________________________________________
