Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_302 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_303 (Dense)            (None, 64)                43456     
_________________________________________________________________
dense_304 (Dense)            (None, 800)               52000     
_________________________________________________________________
dense_305 (Dense)            (None, 160)               128160    
_________________________________________________________________
dense_306 (Dense)            (None, 1)                 161       
=================================================================
Total params: 684,139
Trainable params: 684,139
Non-trainable params: 0
_________________________________________________________________
