Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_191 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_192 (Dense)            (None, 80)                54320     
_________________________________________________________________
dense_193 (Dense)            (None, 352)               28512     
_________________________________________________________________
dense_194 (Dense)            (None, 688)               242864    
_________________________________________________________________
dense_195 (Dense)            (None, 64)                44096     
_________________________________________________________________
dense_196 (Dense)            (None, 240)               15600     
_________________________________________________________________
dense_197 (Dense)            (None, 464)               111824    
_________________________________________________________________
dense_198 (Dense)            (None, 336)               156240    
_________________________________________________________________
dense_199 (Dense)            (None, 768)               258816    
_________________________________________________________________
dense_200 (Dense)            (None, 656)               504464    
_________________________________________________________________
dense_201 (Dense)            (None, 832)               546624    
_________________________________________________________________
dense_202 (Dense)            (None, 992)               826336    
_________________________________________________________________
dense_203 (Dense)            (None, 224)               222432    
_________________________________________________________________
dense_204 (Dense)            (None, 1)                 225       
=================================================================
Total params: 3,472,715
Trainable params: 3,472,715
Non-trainable params: 0
_________________________________________________________________
