Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_21 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_22 (Dense)             (None, 848)               575792    
_________________________________________________________________
dense_23 (Dense)             (None, 592)               502608    
_________________________________________________________________
dense_24 (Dense)             (None, 224)               132832    
_________________________________________________________________
dense_25 (Dense)             (None, 432)               97200     
_________________________________________________________________
dense_26 (Dense)             (None, 64)                27712     
_________________________________________________________________
dense_27 (Dense)             (None, 496)               32240     
_________________________________________________________________
dense_28 (Dense)             (None, 720)               357840    
_________________________________________________________________
dense_29 (Dense)             (None, 208)               149968    
_________________________________________________________________
dense_30 (Dense)             (None, 480)               100320    
_________________________________________________________________
dense_31 (Dense)             (None, 304)               146224    
_________________________________________________________________
dense_32 (Dense)             (None, 896)               273280    
_________________________________________________________________
dense_33 (Dense)             (None, 752)               674544    
_________________________________________________________________
dense_34 (Dense)             (None, 624)               469872    
_________________________________________________________________
dense_35 (Dense)             (None, 576)               360000    
_________________________________________________________________
dense_36 (Dense)             (None, 128)               73856     
_________________________________________________________________
dense_37 (Dense)             (None, 896)               115584    
_________________________________________________________________
dense_38 (Dense)             (None, 672)               602784    
_________________________________________________________________
dense_39 (Dense)             (None, 1)                 673       
=================================================================
Total params: 5,153,691
Trainable params: 5,153,691
Non-trainable params: 0
_________________________________________________________________
