Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_169 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_170 (Dense)            (None, 752)               510608    
_________________________________________________________________
dense_171 (Dense)            (None, 608)               457824    
_________________________________________________________________
dense_172 (Dense)            (None, 512)               311808    
_________________________________________________________________
dense_173 (Dense)            (None, 576)               295488    
_________________________________________________________________
dense_174 (Dense)            (None, 960)               553920    
_________________________________________________________________
dense_175 (Dense)            (None, 880)               845680    
_________________________________________________________________
dense_176 (Dense)            (None, 576)               507456    
_________________________________________________________________
dense_177 (Dense)            (None, 688)               396976    
_________________________________________________________________
dense_178 (Dense)            (None, 800)               551200    
_________________________________________________________________
dense_179 (Dense)            (None, 512)               410112    
_________________________________________________________________
dense_180 (Dense)            (None, 208)               106704    
_________________________________________________________________
dense_181 (Dense)            (None, 880)               183920    
_________________________________________________________________
dense_182 (Dense)            (None, 112)               98672     
_________________________________________________________________
dense_183 (Dense)            (None, 560)               63280     
_________________________________________________________________
dense_184 (Dense)            (None, 240)               134640    
_________________________________________________________________
dense_185 (Dense)            (None, 400)               96400     
_________________________________________________________________
dense_186 (Dense)            (None, 624)               250224    
_________________________________________________________________
dense_187 (Dense)            (None, 432)               270000    
_________________________________________________________________
dense_188 (Dense)            (None, 992)               429536    
_________________________________________________________________
dense_189 (Dense)            (None, 64)                63552     
_________________________________________________________________
dense_190 (Dense)            (None, 1)                 65        
=================================================================
Total params: 6,998,427
Trainable params: 6,998,427
Non-trainable params: 0
_________________________________________________________________
