Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_67 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_68 (Dense)             (None, 784)               532336    
_________________________________________________________________
dense_69 (Dense)             (None, 976)               766160    
_________________________________________________________________
dense_70 (Dense)             (None, 320)               312640    
_________________________________________________________________
dense_71 (Dense)             (None, 752)               241392    
_________________________________________________________________
dense_72 (Dense)             (None, 624)               469872    
_________________________________________________________________
dense_73 (Dense)             (None, 240)               150000    
_________________________________________________________________
dense_74 (Dense)             (None, 304)               73264     
_________________________________________________________________
dense_75 (Dense)             (None, 224)               68320     
_________________________________________________________________
dense_76 (Dense)             (None, 928)               208800    
_________________________________________________________________
dense_77 (Dense)             (None, 288)               267552    
_________________________________________________________________
dense_78 (Dense)             (None, 1024)              295936    
_________________________________________________________________
dense_79 (Dense)             (None, 288)               295200    
_________________________________________________________________
dense_80 (Dense)             (None, 80)                23120     
_________________________________________________________________
dense_81 (Dense)             (None, 1008)              81648     
_________________________________________________________________
dense_82 (Dense)             (None, 912)               920208    
_________________________________________________________________
dense_83 (Dense)             (None, 368)               335984    
_________________________________________________________________
dense_84 (Dense)             (None, 96)                35424     
_________________________________________________________________
dense_85 (Dense)             (None, 992)               96224     
_________________________________________________________________
dense_86 (Dense)             (None, 528)               524304    
_________________________________________________________________
dense_87 (Dense)             (None, 640)               338560    
_________________________________________________________________
dense_88 (Dense)             (None, 992)               635872    
_________________________________________________________________
dense_89 (Dense)             (None, 944)               937392    
_________________________________________________________________
dense_90 (Dense)             (None, 416)               393120    
_________________________________________________________________
dense_91 (Dense)             (None, 1)                 417       
=================================================================
Total params: 8,464,107
Trainable params: 8,464,107
Non-trainable params: 0
_________________________________________________________________
