Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_215 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_216 (Dense)            (None, 176)               119504    
_________________________________________________________________
dense_217 (Dense)            (None, 528)               93456     
_________________________________________________________________
dense_218 (Dense)            (None, 736)               389344    
_________________________________________________________________
dense_219 (Dense)            (None, 256)               188672    
_________________________________________________________________
dense_220 (Dense)            (None, 832)               213824    
_________________________________________________________________
dense_221 (Dense)            (None, 112)               93296     
_________________________________________________________________
dense_222 (Dense)            (None, 1024)              115712    
_________________________________________________________________
dense_223 (Dense)            (None, 704)               721600    
_________________________________________________________________
dense_224 (Dense)            (None, 1024)              721920    
_________________________________________________________________
dense_225 (Dense)            (None, 576)               590400    
_________________________________________________________________
dense_226 (Dense)            (None, 864)               498528    
_________________________________________________________________
dense_227 (Dense)            (None, 400)               346000    
_________________________________________________________________
dense_228 (Dense)            (None, 224)               89824     
_________________________________________________________________
dense_229 (Dense)            (None, 528)               118800    
_________________________________________________________________
dense_230 (Dense)            (None, 112)               59248     
_________________________________________________________________
dense_231 (Dense)            (None, 672)               75936     
_________________________________________________________________
dense_232 (Dense)            (None, 80)                53840     
_________________________________________________________________
dense_233 (Dense)            (None, 1)                 81        
=================================================================
Total params: 4,950,347
Trainable params: 4,950,347
Non-trainable params: 0
_________________________________________________________________
