Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_40 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_41 (Dense)             (None, 112)               76048     
_________________________________________________________________
dense_42 (Dense)             (None, 416)               47008     
_________________________________________________________________
dense_43 (Dense)             (None, 992)               413664    
_________________________________________________________________
dense_44 (Dense)             (None, 128)               127104    
_________________________________________________________________
dense_45 (Dense)             (None, 208)               26832     
_________________________________________________________________
dense_46 (Dense)             (None, 336)               70224     
_________________________________________________________________
dense_47 (Dense)             (None, 512)               172544    
_________________________________________________________________
dense_48 (Dense)             (None, 480)               246240    
_________________________________________________________________
dense_49 (Dense)             (None, 256)               123136    
_________________________________________________________________
dense_50 (Dense)             (None, 80)                20560     
_________________________________________________________________
dense_51 (Dense)             (None, 592)               47952     
_________________________________________________________________
dense_52 (Dense)             (None, 240)               142320    
_________________________________________________________________
dense_53 (Dense)             (None, 240)               57840     
_________________________________________________________________
dense_54 (Dense)             (None, 688)               165808    
_________________________________________________________________
dense_55 (Dense)             (None, 576)               396864    
_________________________________________________________________
dense_56 (Dense)             (None, 464)               267728    
_________________________________________________________________
dense_57 (Dense)             (None, 544)               252960    
_________________________________________________________________
dense_58 (Dense)             (None, 832)               453440    
_________________________________________________________________
dense_59 (Dense)             (None, 336)               279888    
_________________________________________________________________
dense_60 (Dense)             (None, 608)               204896    
_________________________________________________________________
dense_61 (Dense)             (None, 512)               311808    
_________________________________________________________________
dense_62 (Dense)             (None, 672)               344736    
_________________________________________________________________
dense_63 (Dense)             (None, 704)               473792    
_________________________________________________________________
dense_64 (Dense)             (None, 592)               417360    
_________________________________________________________________
dense_65 (Dense)             (None, 832)               493376    
_________________________________________________________________
dense_66 (Dense)             (None, 1)                 833       
=================================================================
Total params: 6,095,323
Trainable params: 6,095,323
Non-trainable params: 0
_________________________________________________________________
