Model: "sequential_22"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_419 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_420 (Dense)            (None, 880)               597520    
_________________________________________________________________
dense_421 (Dense)            (None, 192)               169152    
_________________________________________________________________
dense_422 (Dense)            (None, 768)               148224    
_________________________________________________________________
dense_423 (Dense)            (None, 784)               602896    
_________________________________________________________________
dense_424 (Dense)            (None, 80)                62800     
_________________________________________________________________
dense_425 (Dense)            (None, 1)                 81        
=================================================================
Total params: 2,041,035
Trainable params: 2,041,035
Non-trainable params: 0
_________________________________________________________________
