Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_273 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_274 (Dense)            (None, 528)               358512    
_________________________________________________________________
dense_275 (Dense)            (None, 928)               490912    
_________________________________________________________________
dense_276 (Dense)            (None, 656)               609424    
_________________________________________________________________
dense_277 (Dense)            (None, 704)               462528    
_________________________________________________________________
dense_278 (Dense)            (None, 752)               530160    
_________________________________________________________________
dense_279 (Dense)            (None, 288)               216864    
_________________________________________________________________
dense_280 (Dense)            (None, 512)               147968    
_________________________________________________________________
dense_281 (Dense)            (None, 144)               73872     
_________________________________________________________________
dense_282 (Dense)            (None, 816)               118320    
_________________________________________________________________
dense_283 (Dense)            (None, 672)               549024    
_________________________________________________________________
dense_284 (Dense)            (None, 528)               355344    
_________________________________________________________________
dense_285 (Dense)            (None, 208)               110032    
_________________________________________________________________
dense_286 (Dense)            (None, 496)               103664    
_________________________________________________________________
dense_287 (Dense)            (None, 176)               87472     
_________________________________________________________________
dense_288 (Dense)            (None, 784)               138768    
_________________________________________________________________
dense_289 (Dense)            (None, 512)               401920    
_________________________________________________________________
dense_290 (Dense)            (None, 576)               295488    
_________________________________________________________________
dense_291 (Dense)            (None, 736)               424672    
_________________________________________________________________
dense_292 (Dense)            (None, 704)               518848    
_________________________________________________________________
dense_293 (Dense)            (None, 144)               101520    
_________________________________________________________________
dense_294 (Dense)            (None, 48)                6960      
_________________________________________________________________
dense_295 (Dense)            (None, 48)                2352      
_________________________________________________________________
dense_296 (Dense)            (None, 384)               18816     
_________________________________________________________________
dense_297 (Dense)            (None, 192)               73920     
_________________________________________________________________
dense_298 (Dense)            (None, 848)               163664    
_________________________________________________________________
dense_299 (Dense)            (None, 832)               706368    
_________________________________________________________________
dense_300 (Dense)            (None, 960)               799680    
_________________________________________________________________
dense_301 (Dense)            (None, 1)                 961       
=================================================================
Total params: 8,328,395
Trainable params: 8,328,395
Non-trainable params: 0
_________________________________________________________________
