Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_234 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_235 (Dense)            (None, 432)               293328    
_________________________________________________________________
dense_236 (Dense)            (None, 560)               242480    
_________________________________________________________________
dense_237 (Dense)            (None, 736)               412896    
_________________________________________________________________
dense_238 (Dense)            (None, 880)               648560    
_________________________________________________________________
dense_239 (Dense)            (None, 304)               267824    
_________________________________________________________________
dense_240 (Dense)            (None, 704)               214720    
_________________________________________________________________
dense_241 (Dense)            (None, 368)               259440    
_________________________________________________________________
dense_242 (Dense)            (None, 384)               141696    
_________________________________________________________________
dense_243 (Dense)            (None, 704)               271040    
_________________________________________________________________
dense_244 (Dense)            (None, 656)               462480    
_________________________________________________________________
dense_245 (Dense)            (None, 816)               536112    
_________________________________________________________________
dense_246 (Dense)            (None, 144)               117648    
_________________________________________________________________
dense_247 (Dense)            (None, 896)               129920    
_________________________________________________________________
dense_248 (Dense)            (None, 720)               645840    
_________________________________________________________________
dense_249 (Dense)            (None, 368)               265328    
_________________________________________________________________
dense_250 (Dense)            (None, 1)                 369       
=================================================================
Total params: 5,370,043
Trainable params: 5,370,043
Non-trainable params: 0
_________________________________________________________________
