Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_92 (Dense)             (None, 678)               460362    
_________________________________________________________________
dense_93 (Dense)             (None, 672)               456288    
_________________________________________________________________
dense_94 (Dense)             (None, 656)               441488    
_________________________________________________________________
dense_95 (Dense)             (None, 480)               315360    
_________________________________________________________________
dense_96 (Dense)             (None, 560)               269360    
_________________________________________________________________
dense_97 (Dense)             (None, 128)               71808     
_________________________________________________________________
dense_98 (Dense)             (None, 96)                12384     
_________________________________________________________________
dense_99 (Dense)             (None, 208)               20176     
_________________________________________________________________
dense_100 (Dense)            (None, 704)               147136    
_________________________________________________________________
dense_101 (Dense)            (None, 880)               620400    
_________________________________________________________________
dense_102 (Dense)            (None, 896)               789376    
_________________________________________________________________
dense_103 (Dense)            (None, 704)               631488    
_________________________________________________________________
dense_104 (Dense)            (None, 640)               451200    
_________________________________________________________________
dense_105 (Dense)            (None, 1008)              646128    
_________________________________________________________________
dense_106 (Dense)            (None, 80)                80720     
_________________________________________________________________
dense_107 (Dense)            (None, 832)               67392     
_________________________________________________________________
dense_108 (Dense)            (None, 592)               493136    
_________________________________________________________________
dense_109 (Dense)            (None, 1024)              607232    
_________________________________________________________________
dense_110 (Dense)            (None, 672)               688800    
_________________________________________________________________
dense_111 (Dense)            (None, 656)               441488    
_________________________________________________________________
dense_112 (Dense)            (None, 336)               220752    
_________________________________________________________________
dense_113 (Dense)            (None, 224)               75488     
_________________________________________________________________
dense_114 (Dense)            (None, 1)                 225       
=================================================================
Total params: 8,008,187
Trainable params: 8,008,187
Non-trainable params: 0
_________________________________________________________________
