Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_205 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_206 (Dense)            (None, 848)               575792    
_________________________________________________________________
dense_207 (Dense)            (None, 1008)              855792    
_________________________________________________________________
dense_208 (Dense)            (None, 816)               823344    
_________________________________________________________________
dense_209 (Dense)            (None, 672)               549024    
_________________________________________________________________
dense_210 (Dense)            (None, 896)               603008    
_________________________________________________________________
dense_211 (Dense)            (None, 928)               832416    
_________________________________________________________________
dense_212 (Dense)            (None, 240)               222960    
_________________________________________________________________
dense_213 (Dense)            (None, 400)               96400     
_________________________________________________________________
dense_214 (Dense)            (None, 1)                 401       
=================================================================
Total params: 5,019,499
Trainable params: 5,019,499
Non-trainable params: 0
_________________________________________________________________
