Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_358 (Dense)            (None, 678)               460362    
_________________________________________________________________
dense_359 (Dense)            (None, 896)               608384    
_________________________________________________________________
dense_360 (Dense)            (None, 1024)              918528    
_________________________________________________________________
dense_361 (Dense)            (None, 816)               836400    
_________________________________________________________________
dense_362 (Dense)            (None, 400)               326800    
_________________________________________________________________
dense_363 (Dense)            (None, 80)                32080     
_________________________________________________________________
dense_364 (Dense)            (None, 160)               12960     
_________________________________________________________________
dense_365 (Dense)            (None, 368)               59248     
_________________________________________________________________
dense_366 (Dense)            (None, 224)               82656     
_________________________________________________________________
dense_367 (Dense)            (None, 512)               115200    
_________________________________________________________________
dense_368 (Dense)            (None, 656)               336528    
_________________________________________________________________
dense_369 (Dense)            (None, 736)               483552    
_________________________________________________________________
dense_370 (Dense)            (None, 48)                35376     
_________________________________________________________________
dense_371 (Dense)            (None, 416)               20384     
_________________________________________________________________
dense_372 (Dense)            (None, 688)               286896    
_________________________________________________________________
dense_373 (Dense)            (None, 576)               396864    
_________________________________________________________________
dense_374 (Dense)            (None, 512)               295424    
_________________________________________________________________
dense_375 (Dense)            (None, 224)               114912    
_________________________________________________________________
dense_376 (Dense)            (None, 608)               136800    
_________________________________________________________________
dense_377 (Dense)            (None, 928)               565152    
_________________________________________________________________
dense_378 (Dense)            (None, 672)               624288    
_________________________________________________________________
dense_379 (Dense)            (None, 384)               258432    
_________________________________________________________________
dense_380 (Dense)            (None, 336)               129360    
_________________________________________________________________
dense_381 (Dense)            (None, 80)                26960     
_________________________________________________________________
dense_382 (Dense)            (None, 176)               14256     
_________________________________________________________________
dense_383 (Dense)            (None, 768)               135936    
_________________________________________________________________
dense_384 (Dense)            (None, 688)               529072    
_________________________________________________________________
dense_385 (Dense)            (None, 848)               584272    
_________________________________________________________________
dense_386 (Dense)            (None, 688)               584112    
_________________________________________________________________
dense_387 (Dense)            (None, 1)                 689       
=================================================================
Total params: 9,011,883
Trainable params: 9,011,883
Non-trainable params: 0
_________________________________________________________________
